driver-tests/bpelse/nmproperty/SOAPHeader/src/setSOAPHeaderLeaf.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="setSOAPHeaderLeaf" targetNamespace="http://j2ee.netbeans.org/wsdl/SOAPHeader/setSOAPHeaderLeaf"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/SOAPHeader/setSOAPHeaderLeaf" xmlns:ns="http://localhost/person" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/SOAPHeader/setSOAPHeaderLeaf">
            <xsd:import namespace="http://localhost/person" schemaLocation="person.xsd"/>
        </xsd:schema>
    </types>
    <message name="setSOAPHeaderLeafOperationRequest">
        <part name="part1" element="ns:person"/>
    </message>
    <message name="setSOAPHeaderLeafOperationResponse">
        <part name="part1" element="ns:person"/>
    </message>
    <portType name="setSOAPHeaderLeafPortType">
        <operation name="setSOAPHeaderLeafOperation">
            <input name="input1" message="tns:setSOAPHeaderLeafOperationRequest"/>
            <output name="output1" message="tns:setSOAPHeaderLeafOperationResponse"/>
        </operation>
    </portType>
    <binding name="setSOAPHeaderLeafBinding" type="tns:setSOAPHeaderLeafPortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="setSOAPHeaderLeafOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal"/>
            </input>
            <output name="output1">
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="setSOAPHeaderLeafService">
        <port name="setSOAPHeaderLeafPort" binding="tns:setSOAPHeaderLeafBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/setSOAPHeaderLeafService/setSOAPHeaderLeafPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="setSOAPHeaderLeaf">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="setSOAPHeaderLeafPortTypeRole" portType="tns:setSOAPHeaderLeafPortType"/>
    </plnk:partnerLinkType>
</definitions>
