driver-tests/bpelse/assign/AssignJbi/test/SpecExampleElemToText/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <person xmlns:msgns="http://sun.com/bpel/SpecExampleWsdl" xmlns="http://localhost/person" name="SUN">
            <testType>TestResult</testType>
            <birthdate>
                <month>Feb</month>
                <day>28</day>
                <year>1950</year>
            </birthdate>
            <home>
                <name>Sun Micro</name>
                <street>800 Royal Oaks Drive</street>
                <city>Monrovia</city>
                <state>CA</state>
                <zip>91016</zip>
                <note>January</note>
            </home>
        </person>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>