driver-tests/bpelse/nmproperty/SOAPHeaderCA/test/setSOAPHeader/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header>
    <home xmlns="http://localhost/person" country="US">
      <per:name xmlns:per="http://localhost/person">John Doe</per:name>
      <per:street xmlns:per="http://localhost/person">Street1</per:street>
      <per:city xmlns:per="http://localhost/person">Monrovia</per:city>
      <per:state xmlns:per="http://localhost/person">CA</per:state>
      <per:zip xmlns:per="http://localhost/person">91016</per:zip>
    </home>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <ns1:person xmlns:msgns="http://j2ee.netbeans.org/wsdl/accessSOAPHeader/setSOAPHeader" xmlns:per="http://localhost/person" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns1="http://localhost/person" name="John Doe">
      <per:birthdate>
        <per:month>Aug</per:month>
        <per:day>16</per:day>
        <per:year>2008</per:year>
      </per:birthdate>
      <per:home country="US">
        <per:name>John Doe</per:name>
        <per:street>Street1</per:street>
        <per:city>Monrovia</per:city>
        <per:state>CA</per:state>
        <per:zip>91016</per:zip>
      </per:home>
      <per:work country="US">
        <per:name>John Doe</per:name>
        <per:street>Street1</per:street>
        <per:city>Arcadia</per:city>
        <per:state>CA</per:state>
        <per:zip>91007</per:zip>
      </per:work>
    </ns1:person>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
