driver-tests/bpelse/xsddatatypes/XSDDataTypesJbi/test/ReplacementLogic_for_Copy_ElemToElem1/Output.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><person xmlns="http://localhost/person"><work>
                <per:name xmlns:per="http://localhost/person">John Doe</per:name>
                <per:street xmlns:per="http://localhost/person">Royal Oaks</per:street>
                <per:city xmlns:per="http://localhost/person">Monrovia</per:city>
                <per:state xmlns:per="http://localhost/person">CA</per:state>
                <per:zip xmlns:per="http://localhost/person">91016</per:zip>
            </work></person></SOAP-ENV:Body></SOAP-ENV:Envelope>